arr = list(map(int, input().split()))

# Сортировка вставками
# Сначала берем первый элемент как отсортированный
# Берем текущий и смещаем его пока предыдущий элемент не станет меньше
def insertion_sort(arr):
    for i in range(1, len(arr)): # берем неотсортированную часть (первый по умолчанию отсортирован)
        current_elem = arr[i] # Текущий элемент — первый из неотсортированных
        j = i-1 # индекс последнего отсортированного элемента
        while current_elem < arr[j] and j >= 0: # Пока индекс в диапазоне и текущий меньше отсортированного
            arr[j + 1] = arr[j] # Сдвигаем отсортированнй элемент вправо (текущий затрется, но он сохранен)
            j -= 1 # Идем дальше влево по отсортированной части
        arr[j+1] = current_elem # Если сталкиваемся с меньшим элементом, вставляем текущий после него.
    return arr 
    
    
print(' '.join(list(map(str, insertion_sort(arr)))))




